const Messages = () => {
  return (
    <div className=" bg-slate-500">
      <h1 className="text-3xl bg-slate-600 p-4 mb-8 text-center text-white">الهدف من المشروع:</h1>
      <p className="mb-3 text-lg md:text-xl">رفضاً للدور الذي أراده لنا المستعمر، رفضاً للتبعيّة العمياء، ورفضاً للدّوَران في عجلةِ استهلاكٍ تصبّ أرباحَها في إنتاج أسلحة فتاكة لم تجلب للبشرية عامةً ولشعوبنا العربية والإسلامية خاصةً إلا القتل والدمار، ورفضاً للدور الذي يريده مستعمرونا لنا: "مغلوبٌ مفتون باتباع غالبه"؛ أنشأنا هذه الصفحة سعياً منا لخلق شبكة تجارية تخصّنا، لجمع آلاف المشاريع المحليّة التي تساهم بالارتقاء باقتصادنا وتجارتنا؛ للتّحرر مع الوقت شيئاً فشيئاً من الاعتماد التام على الغرب في معظم أمور حياتنا..</p>
      <p className="mb-3 text-lg md:text-xl">بعنادٍ عربيٍّ نبدأ خطوةً جديدةً تتلوا المقاطعة، وهي الاستغناء، الاستغناء عمّا ينتجه الغرب لنا، والثقة بمنتجنا الوطنيّ والمحليّ، فهو قادرٌ على المنافسة العالمية، بل ويفوق في جودته كثيراً من منتجات الشركات العملاقة التي غزت أسواقنا..</p>
      <p className="mb-3 text-lg md:text-xl">وعليه، فإن هذه الصفحة فضاءٌ مكونٌ من 1 مليون بكسل، نودّ تلوينها بمنتجات بلادنا العربية والإسلامية، مشروعٌ من الشعوب العربية وإليها؛ إذ نُبادر لإيجاد البدائل المحلية، ونجمعها في مكانٍ واحد ليَسهُل عرضُها أمام مجتمعاتنا التي باتت تبحث عن المحلّي كميزةٍ خاصة للمنتج، ونريدها إعلاناً لافتاً مميزاً طويل الأمد وغير مكلف لأصحاب المشاريع المحليّة، حيث ثمن تأجير البكسل الواحد فيها: 1 دينار أردني، وأقلّ مساحة إعلان يمكن استئجارها من هذا الفضاء هي: 100 بكسل، أي أنّ أقل ثمن للإعلان هو: 100 دينار أردني (مما لا يجعله مكلفاً مقارنةً بأسعار الإعلانات عامةً)، على أن يستمر عرض الإعلان المتفق عليه على الصفحة حتى بدء العام 2030 للميلاد.</p>
    </div>
  );
};
export default Messages;
